export const provinces = [
  { code: '110000', name: '北京市' },
  { code: '120000', name: '天津市' },
  { code: '130000', name: '河北省' },
  { code: '140000', name: '山西省' },
  { code: '150000', name: '内蒙古自治区' },
  { code: '210000', name: '辽宁省' },
  { code: '220000', name: '吉林省' },
  { code: '230000', name: '黑龙江省' },
  { code: '310000', name: '上海市' },
  { code: '320000', name: '江苏省' },
  { code: '330000', name: '浙江省' },
  { code: '340000', name: '安徽省' },
  { code: '350000', name: '福建省' },
  { code: '360000', name: '江西省' },
  { code: '370000', name: '山东省' },
  { code: '410000', name: '河南省' },
  { code: '420000', name: '湖北省' },
  { code: '430000', name: '湖南省' },
  { code: '440000', name: '广东省' },
  { code: '450000', name: '广西壮族自治区' },
  { code: '460000', name: '海南省' },
  { code: '500000', name: '重庆市' },
  { code: '510000', name: '四川省' },
  { code: '520000', name: '贵州省' },
  { code: '530000', name: '云南省' },
  { code: '540000', name: '西藏自治区' },
  { code: '610000', name: '陕西省' },
  { code: '620000', name: '甘肃省' },
  { code: '630000', name: '青海省' },
  { code: '640000', name: '宁夏回族自治区' },
  { code: '650000', name: '新疆维吾尔自治区' },
  { code: '710000', name: '台湾省' },
  { code: '810000', name: '香港特别行政区' },
  { code: '820000', name: '澳门特别行政区' }
]

export const cities = {
  '110000': [
    { code: '110100', name: '北京市' }
  ],
  '120000': [
    { code: '120100', name: '天津市' }
  ],
  '310000': [
    { code: '310100', name: '上海市' }
  ],
  '500000': [
    { code: '500100', name: '重庆市' }
  ],
  '440000': [
    { code: '440100', name: '广州市' },
    { code: '440200', name: '韶关市' },
    { code: '440300', name: '深圳市' },
    { code: '440400', name: '珠海市' },
    { code: '440500', name: '汕头市' },
    { code: '440600', name: '佛山市' },
    { code: '440700', name: '江门市' },
    { code: '440800', name: '湛江市' },
    { code: '440900', name: '茂名市' },
    { code: '441200', name: '肇庆市' },
    { code: '441300', name: '惠州市' },
    { code: '441400', name: '梅州市' },
    { code: '441500', name: '汕尾市' },
    { code: '441600', name: '河源市' },
    { code: '441700', name: '阳江市' },
    { code: '441800', name: '清远市' },
    { code: '441900', name: '东莞市' },
    { code: '442000', name: '中山市' },
    { code: '445100', name: '潮州市' },
    { code: '445200', name: '揭阳市' },
    { code: '445300', name: '云浮市' }
  ],
  '330000': [
    { code: '330100', name: '杭州市' },
    { code: '330200', name: '宁波市' },
    { code: '330300', name: '温州市' },
    { code: '330400', name: '嘉兴市' },
    { code: '330500', name: '湖州市' },
    { code: '330600', name: '绍兴市' },
    { code: '330700', name: '金华市' },
    { code: '330800', name: '衢州市' },
    { code: '330900', name: '舟山市' },
    { code: '331000', name: '台州市' },
    { code: '331100', name: '丽水市' }
  ],
  '320000': [
    { code: '320100', name: '南京市' },
    { code: '320200', name: '无锡市' },
    { code: '320300', name: '徐州市' },
    { code: '320400', name: '常州市' },
    { code: '320500', name: '苏州市' },
    { code: '320600', name: '南通市' },
    { code: '320700', name: '连云港市' },
    { code: '320800', name: '淮安市' },
    { code: '320900', name: '盐城市' },
    { code: '321000', name: '扬州市' },
    { code: '321100', name: '镇江市' },
    { code: '321200', name: '泰州市' },
    { code: '321300', name: '宿迁市' }
  ],
  '370000': [
    { code: '370100', name: '济南市' },
    { code: '370200', name: '青岛市' },
    { code: '370300', name: '淄博市' },
    { code: '370400', name: '枣庄市' },
    { code: '370500', name: '东营市' },
    { code: '370600', name: '烟台市' },
    { code: '370700', name: '潍坊市' },
    { code: '370800', name: '济宁市' },
    { code: '370900', name: '泰安市' },
    { code: '371000', name: '威海市' },
    { code: '371100', name: '日照市' },
    { code: '371200', name: '莱芜市' },
    { code: '371300', name: '临沂市' },
    { code: '371400', name: '德州市' },
    { code: '371500', name: '聊城市' },
    { code: '371600', name: '滨州市' },
    { code: '371700', name: '菏泽市' }
  ],
  '410000': [
    { code: '410100', name: '郑州市' },
    { code: '410200', name: '开封市' },
    { code: '410300', name: '洛阳市' },
    { code: '410400', name: '平顶山市' },
    { code: '410500', name: '安阳市' },
    { code: '410600', name: '鹤壁市' },
    { code: '410700', name: '新乡市' },
    { code: '410800', name: '焦作市' },
    { code: '410900', name: '濮阳市' },
    { code: '411000', name: '许昌市' },
    { code: '411100', name: '漯河市' },
    { code: '411200', name: '三门峡市' },
    { code: '411300', name: '南阳市' },
    { code: '411400', name: '商丘市' },
    { code: '411500', name: '信阳市' },
    { code: '411600', name: '周口市' },
    { code: '411700', name: '驻马店市' }
  ],
  '420000': [
    { code: '420100', name: '武汉市' },
    { code: '420200', name: '黄石市' },
    { code: '420300', name: '十堰市' },
    { code: '420500', name: '宜昌市' },
    { code: '420600', name: '襄阳市' },
    { code: '420700', name: '鄂州市' },
    { code: '420800', name: '荆门市' },
    { code: '420900', name: '孝感市' },
    { code: '421000', name: '荆州市' },
    { code: '421100', name: '黄冈市' },
    { code: '421200', name: '咸宁市' },
    { code: '421300', name: '随州市' }
  ],
  '430000': [
    { code: '430100', name: '长沙市' },
    { code: '430200', name: '株洲市' },
    { code: '430300', name: '湘潭市' },
    { code: '430400', name: '衡阳市' },
    { code: '430500', name: '邵阳市' },
    { code: '430600', name: '岳阳市' },
    { code: '430700', name: '常德市' },
    { code: '430800', name: '张家界市' },
    { code: '430900', name: '益阳市' },
    { code: '431000', name: '郴州市' },
    { code: '431100', name: '永州市' },
    { code: '431200', name: '怀化市' },
    { code: '431300', name: '娄底市' }
  ],
  '130000': [
    { code: '130100', name: '石家庄市' },
    { code: '130200', name: '唐山市' },
    { code: '130300', name: '秦皇岛市' },
    { code: '130400', name: '邯郸市' },
    { code: '130500', name: '邢台市' },
    { code: '130600', name: '保定市' },
    { code: '130700', name: '张家口市' },
    { code: '130800', name: '承德市' },
    { code: '130900', name: '沧州市' },
    { code: '131000', name: '廊坊市' },
    { code: '131100', name: '衡水市' }
  ],
  '210000': [
    { code: '210100', name: '沈阳市' },
    { code: '210200', name: '大连市' },
    { code: '210300', name: '鞍山市' },
    { code: '210400', name: '抚顺市' },
    { code: '210500', name: '本溪市' },
    { code: '210600', name: '丹东市' },
    { code: '210700', name: '锦州市' },
    { code: '210800', name: '营口市' },
    { code: '210900', name: '阜新市' },
    { code: '211000', name: '辽阳市' },
    { code: '211100', name: '盘锦市' },
    { code: '211200', name: '铁岭市' },
    { code: '211300', name: '朝阳市' },
    { code: '211400', name: '葫芦岛市' }
  ],
  '350000': [
    { code: '350100', name: '福州市' },
    { code: '350200', name: '厦门市' },
    { code: '350300', name: '莆田市' },
    { code: '350400', name: '三明市' },
    { code: '350500', name: '泉州市' },
    { code: '350600', name: '漳州市' },
    { code: '350700', name: '南平市' },
    { code: '350800', name: '龙岩市' },
    { code: '350900', name: '宁德市' }
  ],
  '360000': [
    { code: '360100', name: '南昌市' },
    { code: '360200', name: '景德镇市' },
    { code: '360300', name: '萍乡市' },
    { code: '360400', name: '九江市' },
    { code: '360500', name: '新余市' },
    { code: '360600', name: '鹰潭市' },
    { code: '360700', name: '赣州市' },
    { code: '360800', name: '吉安市' },
    { code: '360900', name: '宜春市' },
    { code: '361000', name: '抚州市' },
    { code: '361100', name: '上饶市' }
  ],
  '340000': [
    { code: '340100', name: '合肥市' },
    { code: '340200', name: '芜湖市' },
    { code: '340300', name: '蚌埠市' },
    { code: '340400', name: '淮南市' },
    { code: '340500', name: '马鞍山市' },
    { code: '340600', name: '淮北市' },
    { code: '340700', name: '铜陵市' },
    { code: '340800', name: '安庆市' },
    { code: '341000', name: '黄山市' },
    { code: '341100', name: '滁州市' },
    { code: '341200', name: '阜阳市' },
    { code: '341300', name: '宿州市' },
    { code: '341500', name: '六安市' },
    { code: '341600', name: '亳州市' },
    { code: '341700', name: '池州市' },
    { code: '341800', name: '宣城市' }
  ],
  '140000': [
    { code: '140100', name: '太原市' },
    { code: '140200', name: '大同市' },
    { code: '140300', name: '阳泉市' },
    { code: '140400', name: '长治市' },
    { code: '140500', name: '晋城市' },
    { code: '140600', name: '朔州市' },
    { code: '140700', name: '晋中市' },
    { code: '140800', name: '运城市' },
    { code: '140900', name: '忻州市' },
    { code: '141000', name: '临汾市' },
    { code: '141100', name: '吕梁市' }
  ],
  '150000': [
    { code: '150100', name: '呼和浩特市' },
    { code: '150200', name: '包头市' },
    { code: '150300', name: '乌海市' },
    { code: '150400', name: '赤峰市' },
    { code: '150500', name: '通辽市' },
    { code: '150600', name: '鄂尔多斯市' },
    { code: '150700', name: '呼伦贝尔市' },
    { code: '150800', name: '巴彦淖尔市' },
    { code: '150900', name: '乌兰察布市' }
  ],
  '220000': [
    { code: '220100', name: '长春市' },
    { code: '220200', name: '吉林市' },
    { code: '220300', name: '四平市' },
    { code: '220400', name: '辽源市' },
    { code: '220500', name: '通化市' },
    { code: '220600', name: '白山市' },
    { code: '220700', name: '松原市' },
    { code: '220800', name: '白城市' }
  ],
  '230000': [
    { code: '230100', name: '哈尔滨市' },
    { code: '230200', name: '齐齐哈尔市' },
    { code: '230300', name: '鸡西市' },
    { code: '230400', name: '鹤岗市' },
    { code: '230500', name: '双鸭山市' },
    { code: '230600', name: '大庆市' },
    { code: '230700', name: '伊春市' },
    { code: '230800', name: '佳木斯市' },
    { code: '230900', name: '七台河市' },
    { code: '231000', name: '牡丹江市' },
    { code: '231100', name: '黑河市' },
    { code: '231200', name: '绥化市' }
  ],
  '450000': [
    { code: '450100', name: '南宁市' },
    { code: '450200', name: '柳州市' },
    { code: '450300', name: '桂林市' },
    { code: '450400', name: '梧州市' },
    { code: '450500', name: '北海市' },
    { code: '450600', name: '防城港市' },
    { code: '450700', name: '钦州市' },
    { code: '450800', name: '贵港市' },
    { code: '450900', name: '玉林市' },
    { code: '451000', name: '百色市' },
    { code: '451100', name: '贺州市' },
    { code: '451200', name: '河池市' },
    { code: '451300', name: '来宾市' },
    { code: '451400', name: '崇左市' }
  ],
  '460000': [
    { code: '460100', name: '海口市' },
    { code: '460200', name: '三亚市' },
    { code: '460300', name: '三沙市' },
    { code: '460400', name: '儋州市' }
  ],
  '510000': [
    { code: '510100', name: '成都市' },
    { code: '510300', name: '自贡市' },
    { code: '510400', name: '攀枝花市' },
    { code: '510500', name: '泸州市' },
    { code: '510600', name: '德阳市' },
    { code: '510700', name: '绵阳市' },
    { code: '510800', name: '广元市' },
    { code: '510900', name: '遂宁市' },
    { code: '511000', name: '内江市' },
    { code: '511100', name: '乐山市' },
    { code: '511300', name: '南充市' },
    { code: '511400', name: '眉山市' },
    { code: '511500', name: '宜宾市' },
    { code: '511600', name: '广安市' },
    { code: '511700', name: '达州市' },
    { code: '511800', name: '雅安市' },
    { code: '511900', name: '巴中市' },
    { code: '512000', name: '资阳市' }
  ],
  '520000': [
    { code: '520100', name: '贵阳市' },
    { code: '520200', name: '六盘水市' },
    { code: '520300', name: '遵义市' },
    { code: '520400', name: '安顺市' },
    { code: '520500', name: '毕节市' },
    { code: '520600', name: '铜仁市' }
  ],
  '530000': [
    { code: '530100', name: '昆明市' },
    { code: '530300', name: '曲靖市' },
    { code: '530400', name: '玉溪市' },
    { code: '530500', name: '保山市' },
    { code: '530600', name: '昭通市' },
    { code: '530700', name: '丽江市' },
    { code: '530800', name: '普洱市' },
    { code: '530900', name: '临沧市' }
  ],
  '610000': [
    { code: '610100', name: '西安市' },
    { code: '610200', name: '铜川市' },
    { code: '610300', name: '宝鸡市' },
    { code: '610400', name: '咸阳市' },
    { code: '610500', name: '渭南市' },
    { code: '610600', name: '延安市' },
    { code: '610700', name: '汉中市' },
    { code: '610800', name: '榆林市' },
    { code: '610900', name: '安康市' },
    { code: '611000', name: '商洛市' }
  ],
  '620000': [
    { code: '620100', name: '兰州市' },
    { code: '620200', name: '嘉峪关市' },
    { code: '620300', name: '金昌市' },
    { code: '620400', name: '白银市' },
    { code: '620500', name: '天水市' },
    { code: '620600', name: '武威市' },
    { code: '620700', name: '张掖市' },
    { code: '620800', name: '平凉市' },
    { code: '620900', name: '酒泉市' },
    { code: '621000', name: '庆阳市' },
    { code: '621100', name: '定西市' },
    { code: '621200', name: '陇南市' }
  ],
  '630000': [
    { code: '630100', name: '西宁市' },
    { code: '630200', name: '海东市' }
  ],
  '640000': [
    { code: '640100', name: '银川市' },
    { code: '640200', name: '石嘴山市' },
    { code: '640300', name: '吴忠市' },
    { code: '640400', name: '固原市' },
    { code: '640500', name: '中卫市' }
  ],
  '650000': [
    { code: '650100', name: '乌鲁木齐市' },
    { code: '650200', name: '克拉玛依市' },
    { code: '650300', name: '吐鲁番市' },
    { code: '650400', name: '哈密市' },
    { code: '650500', name: '昌吉回族自治州' },
    { code: '650600', name: '博尔塔拉蒙古自治州' },
    { code: '650700', name: '巴音郭楞蒙古自治州' },
    { code: '650800', name: '阿克苏地区' },
    { code: '650900', name: '克孜勒苏柯尔克孜自治州' },
    { code: '651000', name: '喀什地区' },
    { code: '651100', name: '和田地区' },
    { code: '652900', name: '伊犁哈萨克自治州' }
  ],
  '540000': [
    { code: '540100', name: '拉萨市' }
  ]
}

export const districts = {
  '110100': [
    { code: '110101', name: '东城区' },
    { code: '110102', name: '西城区' },
    { code: '110105', name: '朝阳区' },
    { code: '110106', name: '丰台区' },
    { code: '110107', name: '石景山区' },
    { code: '110108', name: '海淀区' },
    { code: '110109', name: '门头沟区' },
    { code: '110111', name: '房山区' },
    { code: '110112', name: '通州区' },
    { code: '110113', name: '顺义区' },
    { code: '110114', name: '昌平区' },
    { code: '110115', name: '大兴区' },
    { code: '110116', name: '怀柔区' },
    { code: '110117', name: '平谷区' },
    { code: '110118', name: '密云区' },
    { code: '110119', name: '延庆区' }
  ],
  '310100': [
    { code: '310101', name: '黄浦区' },
    { code: '310104', name: '徐汇区' },
    { code: '310105', name: '长宁区' },
    { code: '310106', name: '静安区' },
    { code: '310107', name: '普陀区' },
    { code: '310109', name: '虹口区' },
    { code: '310110', name: '杨浦区' },
    { code: '310112', name: '闵行区' },
    { code: '310113', name: '宝山区' },
    { code: '310114', name: '嘉定区' },
    { code: '310115', name: '浦东新区' },
    { code: '310116', name: '金山区' },
    { code: '310117', name: '松江区' },
    { code: '310118', name: '青浦区' },
    { code: '310120', name: '奉贤区' },
    { code: '310151', name: '崇明区' }
  ],
  '440300': [
    { code: '440303', name: '罗湖区' },
    { code: '440304', name: '福田区' },
    { code: '440305', name: '南山区' },
    { code: '440306', name: '宝安区' },
    { code: '440307', name: '龙岗区' },
    { code: '440308', name: '盐田区' },
    { code: '440309', name: '龙华区' },
    { code: '440310', name: '坪山区' },
    { code: '440311', name: '光明区' },
    { code: '440312', name: '大鹏新区' },
    { code: '440313', name: '深汕特别合作区' }
  ],
  '440100': [
    { code: '440103', name: '荔湾区' },
    { code: '440104', name: '越秀区' },
    { code: '440105', name: '海珠区' },
    { code: '440106', name: '天河区' },
    { code: '440111', name: '白云区' },
    { code: '440112', name: '黄埔区' },
    { code: '440113', name: '番禺区' },
    { code: '440114', name: '花都区' },
    { code: '440115', name: '南沙区' },
    { code: '440116', name: '从化区' },
    { code: '440117', name: '增城区' }
  ],
  '440600': [
    { code: '440604', name: '禅城区' },
    { code: '440605', name: '南海区' },
    { code: '440606', name: '顺德区' },
    { code: '440607', name: '三水区' },
    { code: '440608', name: '高明区' }
  ],
  '330100': [
    { code: '330102', name: '上城区' },
    { code: '330105', name: '拱墅区' },
    { code: '330106', name: '西湖区' },
    { code: '330108', name: '滨江区' },
    { code: '330109', name: '萧山区' },
    { code: '330110', name: '余杭区' },
    { code: '330111', name: '富阳区' },
    { code: '330112', name: '临安区' },
    { code: '330113', name: '临平区' },
    { code: '330114', name: '钱塘区' }
  ],
  '320500': [
    { code: '320505', name: '虎丘区' },
    { code: '320506', name: '吴中区' },
    { code: '320507', name: '相城区' },
    { code: '320508', name: '姑苏区' },
    { code: '320509', name: '吴江区' },
    { code: '320510', name: '常熟市' },
    { code: '320581', name: '张家港市' },
    { code: '320582', name: '昆山市' },
    { code: '320583', name: '太仓市' }
  ],
  '500100': [
    { code: '500101', name: '万州区' },
    { code: '500102', name: '涪陵区' },
    { code: '500103', name: '渝中区' },
    { code: '500104', name: '大渡口区' },
    { code: '500105', name: '江北区' },
    { code: '500106', name: '沙坪坝区' },
    { code: '500107', name: '九龙坡区' },
    { code: '500108', name: '南岸区' },
    { code: '500109', name: '北碚区' },
    { code: '500110', name: '綦江区' },
    { code: '500111', name: '大足区' },
    { code: '500112', name: '渝北区' },
    { code: '500113', name: '巴南区' },
    { code: '500114', name: '黔江区' },
    { code: '500115', name: '长寿区' },
    { code: '500116', name: '江津区' },
    { code: '500117', name: '合川区' },
    { code: '500118', name: '永川区' },
    { code: '500119', name: '南川区' },
    { code: '500120', name: '璧山区' },
    { code: '500121', name: '铜梁区' },
    { code: '500122', name: '潼南区' },
    { code: '500123', name: '荣昌区' },
    { code: '500124', name: '开州区' },
    { code: '500125', name: '梁平区' },
    { code: '500126', name: '武隆区' }
  ],
  '510100': [
    { code: '510104', name: '锦江区' },
    { code: '510105', name: '青羊区' },
    { code: '510106', name: '金牛区' },
    { code: '510107', name: '武侯区' },
    { code: '510108', name: '成华区' },
    { code: '510112', name: '龙泉驿区' },
    { code: '510113', name: '青白江区' },
    { code: '510114', name: '新都区' },
    { code: '510115', name: '温江区' },
    { code: '510116', name: '双流区' },
    { code: '510117', name: '郫都区' },
    { code: '510118', name: '新津区' }
  ],
  '420100': [
    { code: '420102', name: '江岸区' },
    { code: '420103', name: '江汉区' },
    { code: '420104', name: '硚口区' },
    { code: '420105', name: '汉阳区' },
    { code: '420106', name: '武昌区' },
    { code: '420107', name: '青山区' },
    { code: '420111', name: '洪山区' },
    { code: '420112', name: '东西湖区' },
    { code: '420113', name: '汉南区' },
    { code: '420114', name: '蔡甸区' },
    { code: '420115', name: '江夏区' },
    { code: '420116', name: '黄陂区' },
    { code: '420117', name: '新洲区' }
  ],
  '430100': [
    { code: '430102', name: '芙蓉区' },
    { code: '430103', name: '天心区' },
    { code: '430104', name: '岳麓区' },
    { code: '430105', name: '开福区' },
    { code: '430111', name: '雨花区' },
    { code: '430121', name: '长沙县' },
    { code: '430181', name: '浏阳市' },
    { code: '430182', name: '宁乡市' }
  ],
  '370100': [
    { code: '370102', name: '历下区' },
    { code: '370103', name: '市中区' },
    { code: '370104', name: '槐荫区' },
    { code: '370105', name: '天桥区' },
    { code: '370112', name: '历城区' },
    { code: '370113', name: '长清区' },
    { code: '370114', name: '章丘区' },
    { code: '370115', name: '济阳区' },
    { code: '370116', name: '莱芜区' },
    { code: '370117', name: '钢城区' }
  ],
  '410100': [
    { code: '410102', name: '中原区' },
    { code: '410103', name: '二七区' },
    { code: '410104', name: '管城回族区' },
    { code: '410105', name: '金水区' },
    { code: '410106', name: '上街区' },
    { code: '410107', name: '惠济区' },
    { code: '410122', name: '中牟县' },
    { code: '410181', name: '巩义市' },
    { code: '410182', name: '荥阳市' },
    { code: '410183', name: '新密市' },
    { code: '410184', name: '新郑市' }
  ],
  '130100': [
    { code: '130102', name: '长安区' },
    { code: '130103', name: '桥西区' },
    { code: '130104', name: '新华区' },
    { code: '130105', name: '井陉矿区' },
    { code: '130107', name: '裕华区' },
    { code: '130108', name: '藁城区' },
    { code: '130109', name: '鹿泉区' },
    { code: '130110', name: '栾城区' }
  ],
  '210100': [
    { code: '210102', name: '和平区' },
    { code: '210103', name: '沈河区' },
    { code: '210104', name: '大东区' },
    { code: '210105', name: '皇姑区' },
    { code: '210106', name: '铁西区' },
    { code: '210111', name: '苏家屯区' },
    { code: '210112', name: '浑南区' },
    { code: '210113', name: '沈北新区' },
    { code: '210114', name: '于洪区' }
  ],
  '120100': [
    { code: '120101', name: '和平区' },
    { code: '120102', name: '河东区' },
    { code: '120103', name: '河西区' },
    { code: '120104', name: '南开区' },
    { code: '120105', name: '河北区' },
    { code: '120106', name: '红桥区' },
    { code: '120110', name: '东丽区' },
    { code: '120111', name: '西青区' },
    { code: '120112', name: '津南区' },
    { code: '120113', name: '北辰区' },
    { code: '120114', name: '武清区' },
    { code: '120115', name: '宝坻区' },
    { code: '120116', name: '滨海新区' },
    { code: '120117', name: '宁河区' },
    { code: '120118', name: '静海区' },
    { code: '120119', name: '蓟州区' }
  ],
  '230100': [
    { code: '230102', name: '道里区' },
    { code: '230103', name: '南岗区' },
    { code: '230104', name: '道外区' },
    { code: '230105', name: '平房区' },
    { code: '230106', name: '松北区' },
    { code: '230107', name: '香坊区' },
    { code: '230108', name: '呼兰区' },
    { code: '230109', name: '阿城区' },
    { code: '230110', name: '双城区' }
  ],
  '350200': [
    { code: '350203', name: '思明区' },
    { code: '350205', name: '海沧区' },
    { code: '350206', name: '湖里区' },
    { code: '350211', name: '集美区' },
    { code: '350212', name: '同安区' },
    { code: '350213', name: '翔安区' }
  ],
  '360100': [
    { code: '360102', name: '东湖区' },
    { code: '360103', name: '西湖区' },
    { code: '360104', name: '青云谱区' },
    { code: '360105', name: '湾里管理局' },
    { code: '360111', name: '青山湖区' },
    { code: '360112', name: '新建区' }
  ],
  '340100': [
    { code: '340102', name: '瑶海区' },
    { code: '340103', name: '庐阳区' },
    { code: '340104', name: '蜀山区' },
    { code: '340111', name: '包河区' }
  ],
  '140100': [
    { code: '140105', name: '小店区' },
    { code: '140106', name: '迎泽区' },
    { code: '140107', name: '杏花岭区' },
    { code: '140108', name: '尖草坪区' },
    { code: '140109', name: '万柏林区' },
    { code: '140110', name: '晋源区' }
  ],
  '150100': [
    { code: '150102', name: '新城区' },
    { code: '150103', name: '回民区' },
    { code: '150104', name: '玉泉区' },
    { code: '150105', name: '赛罕区' }
  ],
  '220100': [
    { code: '220102', name: '南关区' },
    { code: '220103', name: '宽城区' },
    { code: '220104', name: '朝阳区' },
    { code: '220105', name: '二道区' },
    { code: '220106', name: '绿园区' },
    { code: '220112', name: '双阳区' },
    { code: '220113', name: '九台区' }
  ],
  '450100': [
    { code: '450102', name: '兴宁区' },
    { code: '450103', name: '青秀区' },
    { code: '450105', name: '江南区' },
    { code: '450107', name: '西乡塘区' },
    { code: '450108', name: '良庆区' },
    { code: '450109', name: '邕宁区' },
    { code: '450110', name: '武鸣区' }
  ],
  '460100': [
    { code: '460105', name: '秀英区' },
    { code: '460106', name: '龙华区' },
    { code: '460107', name: '琼山区' },
    { code: '460108', name: '美兰区' }
  ],
  '520100': [
    { code: '520102', name: '南明区' },
    { code: '520103', name: '云岩区' },
    { code: '520111', name: '花溪区' },
    { code: '520112', name: '乌当区' },
    { code: '520113', name: '白云区' },
    { code: '520115', name: '观山湖区' }
  ],
  '530100': [
    { code: '530102', name: '五华区' },
    { code: '530103', name: '盘龙区' },
    { code: '530111', name: '官渡区' },
    { code: '530112', name: '西山区' },
    { code: '530113', name: '东川区' },
    { code: '530114', name: '呈贡区' }
  ],
  '540100': [
    { code: '540102', name: '城关区' },
    { code: '540103', name: '堆龙德庆区' },
    { code: '540104', name: '达孜区' }
  ],
  '610100': [
    { code: '610102', name: '新城区' },
    { code: '610103', name: '碑林区' },
    { code: '610104', name: '莲湖区' },
    { code: '610111', name: '灞桥区' },
    { code: '610112', name: '未央区' },
    { code: '610113', name: '雁塔区' },
    { code: '610114', name: '阎良区' },
    { code: '610115', name: '临潼区' },
    { code: '610116', name: '长安区' },
    { code: '610117', name: '高陵区' },
    { code: '610118', name: '鄠邑区' }
  ],
  '620100': [
    { code: '620102', name: '城关区' },
    { code: '620103', name: '七里河区' },
    { code: '620104', name: '西固区' },
    { code: '620105', name: '安宁区' },
    { code: '620111', name: '红古区' }
  ],
  '630100': [
    { code: '630102', name: '城东区' },
    { code: '630103', name: '城中区' },
    { code: '630104', name: '城西区' },
    { code: '630105', name: '城北区' },
    { code: '630121', name: '湟中区' }
  ],
  '640100': [
    { code: '640104', name: '兴庆区' },
    { code: '640105', name: '西夏区' },
    { code: '640106', name: '金凤区' }
  ],
  '650100': [
    { code: '650102', name: '天山区' },
    { code: '650103', name: '沙依巴克区' },
    { code: '650104', name: '新市区' },
    { code: '650105', name: '水磨沟区' },
    { code: '650106', name: '头屯河区' },
    { code: '650107', name: '达坂城区' },
    { code: '650108', name: '米东区' }
  ],
  '330200': [
    { code: '330203', name: '海曙区' },
    { code: '330205', name: '江北区' },
    { code: '330206', name: '北仑区' },
    { code: '330211', name: '镇海区' },
    { code: '330212', name: '鄞州区' }
  ],
  '330300': [
    { code: '330302', name: '鹿城区' },
    { code: '330303', name: '龙湾区' },
    { code: '330304', name: '瓯海区' }
  ],
  '320100': [
    { code: '320102', name: '玄武区' },
    { code: '320104', name: '秦淮区' },
    { code: '320105', name: '建邺区' },
    { code: '320106', name: '鼓楼区' },
    { code: '320111', name: '浦口区' },
    { code: '320113', name: '栖霞区' },
    { code: '320114', name: '雨花台区' },
    { code: '320115', name: '江宁区' },
    { code: '320116', name: '六合区' },
    { code: '320117', name: '溧水区' },
    { code: '320118', name: '高淳区' }
  ],
  '350100': [
    { code: '350102', name: '鼓楼区' },
    { code: '350103', name: '台江区' },
    { code: '350104', name: '仓山区' },
    { code: '350105', name: '马尾区' },
    { code: '350111', name: '晋安区' }
  ],
  '440400': [
    { code: '440402', name: '香洲区' },
    { code: '440403', name: '斗门区' },
    { code: '440404', name: '金湾区' }
  ],
  '440500': [
    { code: '440502', name: '金平区' },
    { code: '440503', name: '龙湖区' },
    { code: '440511', name: '濠江区' },
    { code: '440512', name: '潮阳区' },
    { code: '440513', name: '潮南区' },
    { code: '440514', name: '澄海区' }
  ],
  '441300': [
    { code: '441302', name: '惠城区' },
    { code: '441303', name: '惠阳区' },
    { code: '441304', name: '博罗县' },
    { code: '441322', name: '惠东县' },
    { code: '441323', name: '龙门县' }
  ],
  '330400': [
    { code: '330402', name: '南湖区' },
    { code: '330403', name: '秀洲区' }
  ],
  '330500': [
    { code: '330502', name: '吴兴区' },
    { code: '330503', name: '南浔区' }
  ],
  '330600': [
    { code: '330602', name: '越城区' },
    { code: '330603', name: '柯桥区' },
    { code: '330604', name: '上虞区' }
  ],
  '330700': [
    { code: '330702', name: '婺城区' },
    { code: '330703', name: '金东区' }
  ],
  '330800': [
    { code: '330802', name: '柯城区' },
    { code: '330803', name: '衢江区' }
  ],
  '330900': [
    { code: '330902', name: '定海区' },
    { code: '330903', name: '普陀区' }
  ],
  '331000': [
    { code: '331002', name: '椒江区' },
    { code: '331003', name: '黄岩区' },
    { code: '331004', name: '路桥区' }
  ],
  '331100': [
    { code: '331102', name: '莲都区' }
  ],
  '320200': [
    { code: '320205', name: '锡山区' },
    { code: '320206', name: '惠山区' },
    { code: '320211', name: '滨湖区' },
    { code: '320213', name: '梁溪区' },
    { code: '320214', name: '新吴区' }
  ],
  '320300': [
    { code: '320302', name: '鼓楼区' },
    { code: '320303', name: '云龙区' },
    { code: '320305', name: '贾汪区' },
    { code: '320306', name: '泉山区' },
    { code: '320311', name: '铜山区' }
  ],
  '320400': [
    { code: '320402', name: '天宁区' },
    { code: '320404', name: '钟楼区' },
    { code: '320405', name: '新北区' },
    { code: '320411', name: '武进区' },
    { code: '320412', name: '金坛区' }
  ],
  '320600': [
    { code: '320602', name: '崇川区' },
    { code: '320611', name: '港闸区' },
    { code: '320612', name: '通州区' }
  ],
  '320700': [
    { code: '320703', name: '连云区' },
    { code: '320705', name: '海州区' },
    { code: '320706', name: '赣榆区' }
  ],
  '320800': [
    { code: '320802', name: '淮安区' },
    { code: '320803', name: '淮阴区' },
    { code: '320812', name: '清江浦区' }
  ],
  '320900': [
    { code: '320902', name: '亭湖区' },
    { code: '320903', name: '盐都区' }
  ],
  '321000': [
    { code: '321002', name: '广陵区' },
    { code: '321003', name: '邗江区' },
    { code: '321012', name: '江都区' }
  ],
  '321100': [
    { code: '321102', name: '京口区' },
    { code: '321111', name: '润州区' },
    { code: '321112', name: '丹徒区' }
  ],
  '321200': [
    { code: '321202', name: '海陵区' },
    { code: '321203', name: '高港区' },
    { code: '321204', name: '姜堰区' }
  ],
  '321300': [
    { code: '321302', name: '宿城区' },
    { code: '321311', name: '宿豫区' }
  ],
  '370200': [
    { code: '370202', name: '市南区' },
    { code: '370203', name: '市北区' },
    { code: '370211', name: '黄岛区' },
    { code: '370212', name: '崂山区' },
    { code: '370213', name: '李沧区' },
    { code: '370214', name: '城阳区' }
  ],
  '370300': [
    { code: '370302', name: '淄川区' },
    { code: '370303', name: '张店区' },
    { code: '370304', name: '博山区' },
    { code: '370305', name: '临淄区' },
    { code: '370306', name: '周村区' }
  ]
}